<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Adobe Flash Player installer, imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.ern-st.munkiserverlinux.FlashPlayer</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Install_Adobe_Flash_Player</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.pkg.FlashPlayerExtractPackage</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>unit</key>
				<string>skoler</string>
				<key>munkiimport_name</key>
				<string>%NAME%</string>
				<key>pkginfo</key>
				<dict>
					<key>postinstall_script</key>
					<string>#!/bin/bash
/bin/launchctl unload /Library/LaunchDaemons/com.adobe.fpsaud.plist
rm -f /Library/LaunchDaemons/com.adobe.fpsaud.plist</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiServerImporterLinux</string>
		</dict>
	</array>
</dict>
</plist>
