<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest Google Chrome disk image and imports into MunkiServer.</string>
		<key>Identifier</key>
		<string>com.github.ern-st.munkiserverlinux-recipes.googlechrome</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Chrome</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.2.0</string>
		<key>ParentRecipe</key>
		<string>com.github.autopkg.download.googlechrome</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
	            <string>MunkiInfoCreator</string>
	            <key>Arguments</key>
	            <dict>
	                <key>pkg_path</key>
	                <string>%pathname%</string>
	                <key>info_path</key>
	                <string>%RECIPE_CACHE_DIR%/%NAME%.plist</string>
	            </dict>
	        </dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%pathname%</string>
				</dict>
				<key>Processor</key>
				<string>MunkiServerImporterLinux</string>
			</dict>
		</array>
	</dict>
</plist>
