<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.ern-st.munkiserverlinux.TextMate2</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>TextMate</string>
        <key>BRANCH</key>
        <string>release</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>TextMate brings Apple&apos;s approach to operating systems into the world of text editors. By bridging UNIX underpinnings and GUI, TextMate cherry-picks the best of both worlds to the benefit of expert scripters and novice users alike.</string>
            <key>display_name</key>
            <string>TextMate 2</string>
            <key>postinstall_script</key>
            <string>#!/bin/sh
[ -d /usr/local/bin ] || mkdir -p /usr/local/bin
/bin/cp -f -p /Applications/TextMate.app/Contents/Resources/mate /usr/local/bin/mate
</string>
            <key>postuninstall_script</key>
            <string>#!/bin/sh
[ -e /usr/local/bin/mate ] &amp;&amp; rm -f /usr/local/bin/mate
</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.TextMate2</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_format</key>
                <string>tar_bzip2</string>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>DmgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_root</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%dmg_path%</string>
            </dict>
            <key>Processor</key>
            <string>com.github.ern-st.munkiserverlinux.MSIL/MunkiServerImporterLinux</string>
        </dict>
    </array>
</dict>
</plist>
