<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of GitUp and imports it into Munki. The RELEASE_CHANNEL can be set to "stable" or "continuous".</string>
	<key>Identifier</key>
	<string>com.github.ern-st.munkiserverlinux.GitUp</string>
	<key>Input</key>
	<dict>
		<key>RELEASE_CHANNEL</key>
		<string>stable</string>
		<key>MUNKI_CATEGORY</key>
		<string>Developer Tools</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>GitUp</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Work quickly, safely, and without headaches. The Git interface you've been missing all your life has finally arrived.</string>
			<key>developer</key>
			<string>Pierre-Olivier Latour</string>
			<key>display_name</key>
			<string>GitUp</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/sh

DEST_DIR="/usr/local/bin"

if [[ ! -d "${DEST_DIR}" ]]; then
    /bin/mkdir -p "${DEST_DIR}"
fi

/bin/ln -s "/Applications/GitUp.app/Contents/SharedSupport/gitup" "${DEST_DIR}/gitup"

exit 0
</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.download.GitUp</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DmgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.ern-st.munkiserverlinux.MSIL/MunkiServerImporterLinux</string>
		</dict>
	</array>
</dict>
</plist>
